# Отчёт по лабораторной работе №9

---

## по курсу "Фундаментальная информатика"


Студент группы М8О-108Б-23 Иванов Никита Егорович

Работа выполнена

Преподаватель: каф.806 Севастьянов Виктор Сергеевич

1. Тема: системы программирования на языке С
2. Цель работы: составление и отладка простейшей программы на языке С итеративного характера с целочисленными реккурентными соотношениями, задающими некоторое регулярное движение точки в целочисленной системе координат (i, j) с дискретным временем k и динамическим параметром движения k
3. Задание: Вариант 15
   Реализовать цель лабораторной работы 
4. Идея, метод, алгоритм решения задачи:
   Написать цикл for и использовать парочку арифметических операций. И вывести для каждой итерации полученный результат. Делать это до тех пор, пока координаты не окажутся в эллипсе.
5. Сценарий выполнения работы:
   - Написать программу и ~~не~~радоваться жизни
6. Протокол:
```c
#include <stdio.h>
#include <math.h>

#define min(a,b) (a < b ? a : b)
#define max(a,b) (a > b ? a : b)

int main() {
    int i, j, l, k, ik, jk, lk;
    ik = 7;
    jk = -4;
    lk = -10;
    k = 1;

    while(
        (pow(ik + 10, 2) + pow(jk + 10, 2) > 100) && 
        (pow(ik + 20, 2) + pow(jk + 20, 2) > 100)
    ) {
        i = max((47 * ik) % 25, min((47 * jk) % 30, (47 * lk) % 30)) - k % 15;
        j = min(max((47 * ik) % 25, (47 * jk) % 25), (47 * lk) % 30) + k % 5;
        l = (47 * ik * jk * lk) % 25 + k % 5;
        ik = i, jk = j, lk = l;
        k++;
        if(k > 50) {
            printf("The point did not hit the hole, which is the intersection of two circles.");
            return 0;
        }
    }

    printf("The point hit the hole, which is the intersection of two circles in %d cycles.", k);
    
    return 0;
}
```
```txt
┌──(nikita㉿kali)-[~/…/GitHub/r_lab/LW/9]
└─$ gcc program.c -o program -lm && ./program
The point hit the hole, which is the intersection of two circles in 23 cycles.
i: -13
j: -4
l: 4
```
8. Выводы: Работа является очень важной, так как написание этой программы позволит писать простейшие программы на С