# Отчёт по лаборатрной работе №11

---

## по курсу "Фундаментальная информатика"


Студент группы М8О-108Б-23 Иванов Никита Егорович

Работа выполнена

Преподаватель: каф.806 Севастьянов Виктор Сергеевич

1. Тема: Обработка последовательности литер входного файла. Простейшие приёмы лексического анализа. Диаграммы состояний и переходов.
2. Цель работы: составить программу на Си, выполняющую анализ и обработку вводимого текста в соответствии с заданием.
3. Задание: Вариант 29
   Удалить десятичные числа, не превышающие MAX_INT
4. Идея, метод, алгориитм решения задачи:
   - разобраться что и как тут работает
   - написать программу
5. Сценарий выполнения работы:
    1. гуглить
    2. кодить
    3. пытаться понять, почему неработает
    4. пункт 1
6. Протокол:
```c
#include <stdio.h>
#include <string.h> 

#define INT_MAX 13

int main() {
    char output[256], *pointer, input, buff[16];
    memset(output, 0, sizeof(output));
    pointer = output;

    while ((input = getchar()) != EOF)
    {
        int i = 0, n = 0;
        memset(buff, 0, sizeof(buff));
        while ((int)input > 47 && (int)input < 58)
        {
            buff[i] = input;

            input = getchar();
            i++;
        }

        sscanf(buff, "%d", &n);
        if(n <= INT_MAX)
            for(int j = 0; j < sizeof(buff); j++)
                if(buff[j] > 0)
                    *pointer++ = buff[j];

        if(input != EOF)
            *pointer++ = input;
    }

    printf("\n%s", output);
    
    return 0;
}
```
1. Выводы: я люблю питон! А так, это конечно всё очень важно, можно там понять как все работает изнутри